{
  "about": {
    "birthDate": "1987-03-26"
  },
  "experience": [
    {
      "title": "Lead Frontend Developer",
      "company": "IBM iX, Berlin",
      "description": "A digital agency and design studio by IBM. Here I'm responsible for leading development and decision making for large-scale frontends, mostly driven by React, Node.js and headless CMS like <a href=\"https://strapi.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Strapi</a> and <a href=\"https://www.deviantart.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Magnolia</a>. Also I'm working on some React Native and cross-platform apps. Other technologies include TypeScript, GraphQL, <a href=\"https://spring.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Java Spring Boot</a>, etc.. Besides that I am mentoring trainees and junior React developers.",
      "startDate": "2019-08-01",
      "endDate": "now"
    },
    {
      "title": "Senior Software Developer",
      "company": "Model Engineering Solutions GmbH, Berlin",
      "description": "A company specialized in quality assurance of software projects, well-known in the automobile industry. I helped developing the so-called Quality Commander, a huge project to visualize Big Data collected from other inhouse software. Used technologies are C# in backend and TypeScript, React as well as <a href=\"https://d3js.org/\" target=\"_blank\" rel=\"noopener noreferrer\">D3.js</a> in frontend.",
      "startDate": "2019-03-01",
      "endDate": "2019-07-31"
    },
    {
      "title": "Senior Full-Stack Developer",
      "company": "Cybay New Media GmbH, Hanover",
      "description": "A small digital agency based in Hanover where I dealt with the creation of websites, further development of existing websites, as well as the care for existing customers. In addition to PHP, <a href=\"https://laravel.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Laravel</a>, <a href=\"https://statamic.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Statamic</a> and <a href=\"https://wordpress.com/\" target=\"_blank\" rel=\"noopener noreferrer\">WordPress</a>, the technologies used include JavaScript, Flow, React for the development of Progressive Web Apps and also React Native for mobile development.",
      "startDate": "2018-01-01",
      "endDate": "2019-02-28"
    },
    {
      "title": "Software Developer",
      "company": "ABIAN GmbH, Hanover",
      "description": "Originally hired as a developer for web-based software (e.g. for the <a href=\"https://www.messe.de/\" target=\"_blank\" rel=\"noopener noreferrer\">Deutsche Messe AG</a> and CeBIT), over time I took over more and more tasks and was responsible for the implementation of responsive websites and mobile apps, from conception to development towards implementation with PHP, JavaScript and CSS with well-known frameworks like <a href=\"https://laravel.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Laravel</a>, Angular, React and Bootstrap.",
      "startDate": "2014-01-01",
      "endDate": "2017-12-31"
    },
    {
      "title": "Junior Web Developer",
      "company": "eMedienservice Nord, Oldenburg",
      "description": "An agency, a subsidiary of the Nordwest-Zeitung, from which I was taken over after working at QP media GmbH. In addition to the independent development of responsive websites and WordPress theming, my activities also included the programming of <a href=\"https://www.nwzonline.de/\" target=\"_blank\" rel=\"noopener noreferrer\">NWZonline.de</a> with Java and JavaServer Pages.",
      "startDate": "2013-08-01",
      "endDate": "2013-12-31"
    },
    {
      "title": "Junior Web Developer",
      "company": "QP media GmbH, Oldenburg",
      "description": "A small startup, sponsored by Nordwest-Zeitung, which dealt with couponing and printing vouchers. From the first day on I accompanied the startup and developed a well-known, regional coupon platform. Programming languages used included Python (with <a href=\"https://www.djangoproject.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Django</a>) and JavaScript as well as <a href=\"https://coffeescript.org/\" target=\"_blank\" rel=\"noopener noreferrer\">CoffeeScript</a> with <a href=\"https://backbonejs.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Backbone.js</a>.",
      "startDate": "2011-10-01",
      "endDate": "2013-07-31"
    }
  ],
  "education": [
    {
      "title": "Hochschule Emden/Leer",
      "graduation": "Bachelor of Science",
      "subject": "Computer Science - Web Development Track",
      "gpa": 2.31,
      "startDate": "2008-09-01",
      "endDate": "2012-03-31"
    }
  ],
  "projects": [
    {
      "title": "BARMER Design System",
      "technologies": ["React Native", "WebComponents", "TypeScript"],
      "description": "The BARMER Design System is a multi-platform design system with over 100 components that work with React DOM and also React Native. All components are implemented with one single codebase and are adapted for multi-platform support using <a href=\"https://necolas.github.io/react-native-web/\" target=\"_blank\" rel=\"noopener noreferrer\">React Native for Web</a> and offer SSR capibilities. The design system also contains all components as WebComponents that work completely framework-agnostic. I built the whole design system from ground up and implemented every single component with React for 3 platforms, Web, iOS and Android. For the WebComponents I used the great micro-library <a href=\"https://atomicojs.dev/\" target=\"_blank\" rel=\"noopener noreferrer\">Atomico</a>. While working on this project I contributed a lot to the React Native community, <a href=\"https://emotion.sh/\" target=\"_blank\" rel=\"noopener noreferrer\">Emotion</a>, <a href=\"https://atomicojs.dev/\" target=\"_blank\" rel=\"noopener noreferrer\">Atomico</a> and also published some own libraries.",
      "startDate": "2020-02-01",
      "endDate": "now"
    },
    {
      "title": "iF Design Award Jury App",
      "technologies": ["React Native", "Expo", "JavaScript", "Flow"],
      "description": "The iF Design Award Jury App is an internal app, that is used by jurors to rate and comment on product submissions. It's kind of a barcode scanner, where the jurors can scan the barcode of a product submission and then give a rating and/or nominate products for the Design Award. I used React Native and <a href=\"https://expo.dev/\" target=\"_blank\" rel=\"noopener noreferrer\">Expo</a> to create the app and used plain JavaScript with Flow type-checking.",
      "startDate": "2018-12-01",
      "endDate": "2019-02-28"
    },
    {
      "title": "iF WORLD DESIGN GUIDE",
      "technologies": ["PHP", "Laravel", "GraphQL", "React", "JavaScript", "Flow", "Sass"],
      "description": "The iF WORLD DESIGN GUIDE was a product design platform by the iF Design Award. The platform featured 2,400 design studios, about 3,800 company profiles and more than 500,000 products. The platform was implemented with PHP, <a href=\"https://laravel.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Laravel</a> and GraphQL on the backend and mostly vanilla JavaScript and Flow type-checking on the frontend, plus some micro-frontends that I later implemented with React. The products and everything was saved in a <a href=\"https://www.postgresql.org/\" target=\"_blank\" rel=\"noopener noreferrer\">PostgreSQL</a> database and as the CMS for editorial content I used <a href=\"https://statamic.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Statamic</a>, which is a Git-powered flatfile CMS.",
      "startDate": "2017-01-01",
      "endDate": "2019-02-28"
    }
  ]
}
